---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationSecondarySize
source: html/e381f64e-432f-d0fc-3a7b-d13b8cea4ef8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationSecondarySize Property

"Size of Secondary End"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationSecondarySize { get; }
```